# IntegerParameterValue Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntegerParameterValue Constructor
IntegerParameterValue Class See Also
---
Default constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public IntegerParameterValue()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IntegerParameterValue()
```

# See Also
IntegerParameterValue Class
IntegerParameterValue Overload
Autodesk.Revit.DB Namespace